; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	spectrograph2 - mode
	infrared1 - mode
	spectrograph3 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star13 - direction
	GroundStation14 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite1 GroundStation8)
	(have_image Planet15 spectrograph2)
	(have_image Star16 infrared1)
	(have_image Planet17 spectrograph2)
	(have_image Star18 spectrograph3)
	(have_image Star19 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation8 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation8)
   goals met: 1 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
3. (calibrate satellite1 instrument1 groundstation8)
   added: (calibrated instrument1)
   goals met: 1 of 6
4. (turn_to satellite1 planet15 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 planet15)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
6. (take_image satellite1 planet15 instrument1 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 1 of 6
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
8. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 6
9. (turn_to satellite0 planet17 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet17)
   goals met: 1 of 6
10. (take_image satellite0 planet17 instrument0 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 2 of 6
11. (turn_to satellite0 star16 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star16)
   goals met: 2 of 6
12. (take_image satellite0 star16 instrument0 infrared1)
   added: (have_image star16 infrared1)
   goals met: 3 of 6
13. (turn_to satellite1 star18 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star18)
   goals met: 3 of 6
14. (take_image satellite1 star18 instrument1 spectrograph3)
   added: (have_image star18 spectrograph3)
   goals met: 4 of 6
15. (turn_to satellite1 star19 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star19)
   goals met: 4 of 6
16. (take_image satellite1 star19 instrument1 spectrograph3)
   added: (have_image star19 spectrograph3)
   goals met: 5 of 6
17. (turn_to satellite1 groundstation8 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 groundstation8)
   goals met: 6 of 6
